[
  "I can't believe I made it anywhere creatively, though, because I was raised by two loving and supportive parents. Nothing squashes creativity more than unconditional love and support from a functional household. If you have kids, sh*t on their dreams a little bit.",
  "I'm at that age right now where all my friends are getting married, and I'm just getting drunk.",
  "Joe asked God, \"How much is a penny worth in heaven?\" God replied, \"$1 million.\" Joe asked,\"How long is a minute in heaven?\" God said, \"One million years.\" Joe asked for a penny. God said, \"Sure, in a minute.\"",
  "Life's going good for me. I just bought my first new thing with my little bit of comedy money. I got myself an '07 Hyundai Sonata.",
  "I don't know if you guys have ever been to a campground or not, but it's pretty much a bunch of people who don't live in a trailer park, yet like to vacation there.",
  "What do you get when you put 50 lawyers in a room with 50 lesbians? One hundred people who don't do dick.",
  "Opinions are like assholes. Everyone has one, and everyone elses' stinks.",
  "I'm tired of people saying all black people look alike. We don't all look alike. Ain't it funny how they always say we all look alike until we go cash a check? Then we don't look like nobody.",
  "I just got a car, and I gotta say, this car is very cryptic. The very first day I drove it, a light came on out of nowhere: 'Check engine.' Could they be any more vague? What if a light came on and said, 'Problem'?",
  "A bear walks into a bar and says to the bartender, \"I'll have a pint of beer and a.......... packet of peanuts.\" The bartender asks, \"Why the big pause?\"",
  "I had to fight this guy because he was calling me names from across the street, right? Then he calls me 'chicken' -- screw that, right? Instead of proving I'm not chicken, I crossed the road to get to the other side.",
  "Didn't you like those old shows, like 'Tarzan'? Remember 'Tarzan'? Story about a white guy who grew up in a predominantly black neighborhood?",
  "A drunk man was staggering home with a pint of booze in his back pocket when he slipped and fell heavily. Struggling to his feet, he felt something wet running down his leg.\"Please God,\" he thought. \"Let it be blood!\"",
  "You have to incorporate a young, 18 to 21-year-old white dude in your drinking crew and I'm going to tell you why. It's because that age white boy is the only species on this planet that is still excited about drinking.",
  "One reason I love performing in New York is just 'cause the diversity of the crowds. It's like you're constantly walking around in a Black Eyed Peas video.",
  "Over there, they smoke pot. They mix it with hash and tobacco, and they roll it together. The reason why they do that -- they have so many vices, they need to combine them."
]
